pl-sql/4-5.tex
% Created 2023-11-10 Fri 23:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Agustín Alejandro Mota Hinojosa}
\date{\today}
\title{4-5: Iterative Control: Nested Loops}
\hypersetup{
 pdfauthor={Agustín Alejandro Mota Hinojosa},
 pdftitle={4-5: Iterative Control: Nested Loops},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Try It / Solve It}
\label{sec:org9e3fb80}

\begin{enumerate}
\item Write a PL/SQL block to produce a list of available vehicle license plate numbers. These numbers must be in the following format: NN-MMM, where NN is between 60 and 65, and MMM is between 100 and 110. Use nested FOR loops. The outer loop should choose numbers between 60 and 65. The inner loop should choose numbers between 100 and 110, and concatenate the two numbers together.
\begin{verbatim}
DECLARE
 v_num1 NUMBER(2);
 v_num2 NUMBER(3);
BEGIN
 FOR v_num1 IN 60..65 LOOP
  FOR v_num2 IN 100..110 LOOP
   DBMS_OUTPUT.PUT_LINE(v_num1 || '-' || v_num2);
  END LOOP;
 END LOOP;
END;
\end{verbatim}

\item 2. Modify your block from question 1 to calculate the sum of the two numbers on each iteration of the inner loop (for example, 62-107 sums to 169), and exit from the OUTER loop if the sum of the two numbers is greater than 172. Use loop labels. Test your modified code.
\begin{verbatim}
DECLARE
 v_num1 NUMBER(2);
 v_num2 NUMBER(3);
BEGIN
 <<outerloop>>
 FOR v_num1 IN 60..65 LOOP
  <<innerloop>>
  FOR v_num2 IN 100..110 LOOP
   DBMS_OUTPUT.PUT_LINE(v_num1 + v_num2);
   EXIT WHEN v_num1 + v_num2 > 172;
  END LOOP innerloop;
 END LOOP outerloop;
END;
\end{verbatim}
\end{enumerate}
\end{document}